{
  "run_id": "20260113_221226",
  "url": "https://app.fabric.microsoft.com/view?r=eyJrIjoiNDJjZTYzNDMtNDc0Mi00NGI5LTljOTMtNGNmYjNjYWQxYTk0IiwidCI6ImQ4ZTFiMDVlLTcwYWEtNGVmNy1iODc4LTQ2NmI2ODhmOTUyZiJ9",
  "timestamp": "2026-01-13T22:12:26.312558",
  "pages": [
    {
      "id": 0,
      "label": "Home",
      "filename": "00_home.png",
      "analysis": {
        "titulo_painel": "FINANCIAL PERFORMANCE | SUMMARY",
        "objetivo_macro": "Monitoramento do desempenho financeiro e de vendas, com análise comparativa em relação ao ano anterior e desdobramento por diferentes dimensões de negócio.",
        "perguntas_respondidas": [
          "Qual o desempenho geral de vendas, custo e lucro em comparação com o ano anterior?",
          "Qual a tendência mensal de vendas e como ela se compara ao mesmo período do ano anterior?",
          "Quais os principais estados em volume de vendas e qual a sua performance comparativa?",
          "Como as vendas se decompõem por segmento de cliente, categoria de produto e região?"
        ],
        "dominio_negocio": "Vendas e Finanças",
        "elementos_visuais": "Layout composto por cartões de KPIs com minigráficos de tendência, um gráfico de decomposição de vendas por dimensão, um gráfico de barras horizontal para ranking geográfico, um mapa de distribuição de vendas e um gráfico de colunas para evolução mensal comparativa.",
        "filtros_visiveis": [
          "Ano",
          "Segmento",
          "Categoria",
          "Região"
        ],
        "principais_indicadores": [
          "Valor de Vendas",
          "Valor de Custo",
          "Valor de Lucro",
          "Quantidade de Pedidos",
          "Variação vs Ano Anterior (LY)"
        ],
        "publico_sugerido": "Executivo, Analista de Vendas"
      }
    },
    {
      "id": 1,
      "label": "Ir para Pág 2",
      "filename": "01_target.png",
      "analysis": {
        "titulo_painel": "FINANCIAL PERFORMANCE | MARKET ANALYSIS",
        "objetivo_macro": "Monitoramento da performance financeira e análise de mercado, com foco em vendas, custos e lucratividade.",
        "perguntas_respondidas": [
          "Qual a evolução mensal das vendas, detalhada por segmento de mercado?",
          "Quais segmentos e clientes possuem a maior representatividade no faturamento total?",
          "Como a performance atual de vendas, custo e lucro se compara com o mesmo período do ano anterior?",
          "Existe uma correlação entre o volume de vendas e a lucratividade por cliente ou transação?"
        ],
        "dominio_negocio": "Vendas e Finanças",
        "elementos_visuais": "Estruturado com cartões de KPIs no topo para uma visão geral da performance. Apresenta um gráfico de colunas para análise de tendência mensal por segmento, uma tabela detalhada comparando o período atual com o ano anterior, um ranking em gráfico de barras horizontais para identificar os principais clientes e um gráfico de dispersão para correlacionar vendas e lucro.",
        "filtros_visiveis": [
          "Ano",
          "Segmento",
          "Categoria",
          "Região"
        ],
        "principais_indicadores": [
          "Sales (Vendas)",
          "Cost (Custo)",
          "Profit (Lucro)",
          "Orders (Pedidos)",
          "Avg. Order (Ticket Médio)",
          "Variação vs Ano Anterior (YoY)"
        ],
        "publico_sugerido": "Executivo, Analista de Mercado"
      }
    },
    {
      "id": 2,
      "label": "Ir para Pág 3",
      "filename": "02_target.png",
      "analysis": {
        "titulo_painel": "FINANCIAL PERFORMANCE | PRODUCT ANALYSIS",
        "objetivo_macro": "Analisar a performance financeira e de vendas da empresa, com foco no desempenho de produtos, categorias e segmentos de clientes.",
        "perguntas_respondidas": [
          "Qual a evolução mensal das vendas e como ela se compara com o mesmo período do ano anterior?",
          "Quais são os produtos com maior volume de vendas para um determinado período ou segmento?",
          "Qual o desempenho comparativo (vendas, custo e lucro) entre as diferentes sub-categorias de produtos?",
          "Qual é a performance financeira consolidada (Vendas, Custo, Lucro, Pedidos) para a seleção de filtros aplicada?",
          "Existe uma correlação visível entre o volume de vendas e o lucro gerado por cada produto?"
        ],
        "dominio_negocio": "Vendas",
        "elementos_visuais": "Composto por cartões de KPIs para os principais indicadores financeiros, um gráfico combinado de linha e barras para análise de tendência temporal de vendas, um ranking de produtos em barras horizontais, uma matriz detalhando a performance por sub-categoria com comparativos anuais, e um gráfico de dispersão para análise de correlação entre métricas.",
        "filtros_visiveis": [
          "Year (Ano)",
          "Segment (Segmento)",
          "Category (Categoria)",
          "Region (Região)"
        ],
        "principais_indicadores": [
          "Sales (Vendas)",
          "Cost (Custo)",
          "Profit (Lucro)",
          "Orders (Pedidos)",
          "Avg. Order (Ticket Médio)"
        ],
        "publico_sugerido": "Analista de Vendas, Gerente de Produto, Executivo"
      }
    },
    {
      "id": 3,
      "label": "Ir para Pág 4",
      "filename": "03_target.png",
      "analysis": {
        "titulo_painel": "FINANCIAL PERFORMANCE | TRANSACTION",
        "objetivo_macro": "Auditoria e consulta detalhada da performance financeira de transações individuais.",
        "perguntas_respondidas": [
          "Quais são os detalhes de uma transação específica, buscando pelo seu ID?",
          "Qual a performance financeira (Vendas, Custo, Lucro, Margem) de cada transação individual?",
          "Quais transações ocorreram para uma combinação específica de Segmento de cliente, Categoria de produto e Região?",
          "É possível identificar e listar as transações que geraram prejuízo em um determinado período?",
          "Qual foi a quantidade vendida em cada pedido?"
        ],
        "dominio_negocio": "Vendas / Financeiro",
        "elementos_visuais": "Tabela detalhada (matriz) que exibe múltiplos atributos e métricas financeiras para cada transação individual, com indicadores visuais de performance (semáforos) para a rentabilidade.",
        "filtros_visiveis": [
          "Período (Ano/Mês)",
          "Segmento",
          "Categoria",
          "Região",
          "ID do Pedido (Order ID)"
        ],
        "principais_indicadores": [
          "Sales",
          "Cost",
          "Quantity Sold",
          "Profit",
          "Profit%"
        ],
        "publico_sugerido": "Analista Financeiro, Analista de Vendas, Operacional"
      }
    }
  ],
  "navigation_structure": {
    "nav_type": "native_footer",
    "page_count_visual": "1 de 4",
    "targets": [
      {
        "label": "Ir para Pág 2",
        "x": 0.523,
        "y": 0.986
      },
      {
        "label": "Ir para Pág 3",
        "x": 0.523,
        "y": 0.986
      },
      {
        "label": "Ir para Pág 4",
        "x": 0.523,
        "y": 0.986
      }
    ]
  }
}